print("Задача №1")
a = "Ойбек"
b = "Касымов"
print(a, b),
print(sep="\n\n")

print("Задача №2")
a = 35
b = "сфера компьютеров и всё что с ними связано"
c = "работаю"
d = "Бюро принудиительного исполнения"
e = "специалистом в отделе внедрения ИКТ"
f = "города Ташкента."
print("Мне", a, "лет.", "Я работаю", e, "в", d, f, "Меня интересует", b, ".")
print(sep="\n\n")

print("Задача №3")
a = 25
b = 15
c = 34
d = 61
e = 43
f = 58

c = a + b
print(c)

d += 2
print(d)

b *= 2
print(b)

e /= 2
print(e)

f //= 2
print(f)

d = e - 2
print(d)
print(sep="\n\n")

print("Задача №4")
import math

print(
    math.gcd(a, b)
)  #Возвращает наибольший общий делитель a и b. НОД — это самое большое число, на которое a и b делятся без остатка

print(math.trunc(
    d))  #trunc() вернёт вам целую часть переданного в неё аргумента.
